diary/201607/9.org
#+TITLE:org常用快捷键
#+AUTHOR:ALIANG
#+EMAIL:anbgsl1110@gmail.com
#+KEYWORDS:DIARY
【aliang diary】-青春无限可能，拎得清，爱生活，爱自己

-日期：2016-07-12；作者：阿亮；关键字：笔记、org
* org常用快捷键
更多快捷键:C-c+C-x+C-h查看

五条短线或以上显示为分割线
** 折叠大纲
1.Shift+Tab:循环切换整个文档的大纲状态(三种状态：折叠，打开下一级，打开全部)

2.Tab:循环切换光标所在大纲的状态
** 在大纲之前移动
3.C-c+C-n/p:下/上一标题

4.C-c+C-f/b:下/上一标题(仅限同级标题)

5.C-c+C-U:跳到上一级标题

6.C-c+C-j:切换到大纲浏览状态
** 给予大纲的编辑
7.M-Ret:插入一个同级标题

8.M-s-Ret:插入一个同级的TODO标题

9.M-左/右方向键：将当前标题升降级

10.M-上/下方向键：将当前标题上下移

11.M-S-左/右方向键：将当前子树升降级

12.M-S-上/下方向键：将当前子树升降级

13.C-c+*:将本行设为标题或者正文

14.C-x+n+s/w；只显示当前子树/返回

15.C-c+l:保存链接

16.C-c+%:记录内部链接地址

17.C-c+&：跳转到已记录的内部链接
** 表格快捷键
18.C-c+|:创建或者转换成表格

19.C-c+C-c:调整表格不移动光标

20.Tab:移动到下一区域，必要时新建一行

21.S-Tab:移动到上一区域

22.Ret:移动到下一行，必要时新建一行

23.M-左/右方向键：移动列

24.M-上/下方向键：移动行

25.M-S+左/右方向键：删除|插入列

26.M-S+上/下方向键：删除|插入行

27.C-c+-:添加水平分割线

28.C-c+Ret:添加水平分割线并跳到下一行

29.C-c+^:根据当前列排序，可以选择排序方式
** 列表
Org能够识别有序列表、无序列表和描述列表。

/*无序列表项以-、=+=、或者*开头。

/*有序列表以1.或者1)开头。

/*描述列表用::将项和描述分开。

/*有序列表和无序列表都以缩进表示层级。只要对齐缩进，不管是换行还是分块都认为是处于当前列表项。

同一列表中的项的第一行必须缩进相同程度。当下一行的缩进与列表项的开头的符号或者数字相同或者
更小时，这一项就结束了。当所有的项都关上时，或者后面有两个空行时，列表就结束了。

快捷键：

30.Tab:折叠列表项

31.M-Ret:插入项

32.M-s-上/下方向键:移动列表项

33.M-左/右方向键：升降级列表项，不包括子项

33.M-s-左/右方向键：升降级列表项，包括子项

34.C-c+C-c:改变复选框状态

35.C-c+-:更换列表标记(循环切换)
