diary/201607/9.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">

<head>
  <title>org常用快捷键</title>
  <meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
  <meta name="title" content="org常用快捷键" />
  <meta name="generator" content="Org-mode" />
  <meta name="generated" content="2016-07-22T19:59+0800" />
  <meta name="author" content="ALIANG" />
  <meta name="description" content="" />
  <meta name="keywords" content="DIARY" />

</head>

<body>

  <div id="preamble">

  </div>

  <div id="content">
    <h1 class="title">org常用快捷键</h1>

    <p>【aliang diary】-青春无限可能，拎得清，爱生活，爱自己
    </p>
    <p>
      -日期：2016-07-12；作者：阿亮；关键字：笔记、org
    </p>
    <div id="table-of-contents">
      <h2>Table of Contents</h2>
      <div id="text-table-of-contents">
        <ul>
          <li><a href="#sec-1">1 org常用快捷键</a>
            <ul>
              <li><a href="#sec-1-1">1.1 折叠大纲</a></li>
              <li><a href="#sec-1-2">1.2 在大纲之前移动</a></li>
              <li><a href="#sec-1-3">1.3 给予大纲的编辑</a></li>
              <li><a href="#sec-1-4">1.4 表格快捷键</a></li>
              <li><a href="#sec-1-5">1.5 列表</a></li>
            </ul>
          </li>
        </ul>
      </div>
    </div>

    <div id="outline-container-1" class="outline-2">
      <h2 id="sec-1"><span class="section-number-2">1</span> org常用快捷键</h2>
      <div class="outline-text-2" id="text-1">

        <p>更多快捷键:C-c+C-x+C-h查看
        </p>
        <p>
          五条短线或以上显示为分割线
        </p>
      </div>

      <div id="outline-container-1-1" class="outline-3">
        <h3 id="sec-1-1"><span class="section-number-3">1.1</span> 折叠大纲</h3>
        <div class="outline-text-3" id="text-1-1">

          <p>1.Shift+Tab:循环切换整个文档的大纲状态(三种状态：折叠，打开下一级，打开全部)
          </p>
          <p>
            2.Tab:循环切换光标所在大纲的状态
          </p>
        </div>

      </div>

      <div id="outline-container-1-2" class="outline-3">
        <h3 id="sec-1-2"><span class="section-number-3">1.2</span> 在大纲之前移动</h3>
        <div class="outline-text-3" id="text-1-2">

          <p>3.C-c+C-n/p:下/上一标题
          </p>
          <p>
            4.C-c+C-f/b:下/上一标题(仅限同级标题)
          </p>
          <p>
            5.C-c+C-U:跳到上一级标题
          </p>
          <p>
            6.C-c+C-j:切换到大纲浏览状态
          </p>
        </div>

      </div>

      <div id="outline-container-1-3" class="outline-3">
        <h3 id="sec-1-3"><span class="section-number-3">1.3</span> 给予大纲的编辑</h3>
        <div class="outline-text-3" id="text-1-3">

          <p>7.M-Ret:插入一个同级标题
          </p>
          <p>
            8.M-s-Ret:插入一个同级的TODO标题
          </p>
          <p>
            9.M-左/右方向键：将当前标题升降级
          </p>
          <p>
            10.M-上/下方向键：将当前标题上下移
          </p>
          <p>
            11.M-S-左/右方向键：将当前子树升降级
          </p>
          <p>
            12.M-S-上/下方向键：将当前子树升降级
          </p>
          <p>
            13.C-c+*:将本行设为标题或者正文
          </p>
          <p>
            14.C-x+n+s/w；只显示当前子树/返回
          </p>
          <p>
            15.C-c+l:保存链接
          </p>
          <p>
            16.C-c+%:记录内部链接地址
          </p>
          <p>
            17.C-c+&amp;：跳转到已记录的内部链接
          </p>
        </div>

      </div>

      <div id="outline-container-1-4" class="outline-3">
        <h3 id="sec-1-4"><span class="section-number-3">1.4</span> 表格快捷键</h3>
        <div class="outline-text-3" id="text-1-4">

          <p>18.C-c+|:创建或者转换成表格
          </p>
          <p>
            19.C-c+C-c:调整表格不移动光标
          </p>
          <p>
            20.Tab:移动到下一区域，必要时新建一行
          </p>
          <p>
            21.S-Tab:移动到上一区域
          </p>
          <p>
            22.Ret:移动到下一行，必要时新建一行
          </p>
          <p>
            23.M-左/右方向键：移动列
          </p>
          <p>
            24.M-上/下方向键：移动行
          </p>
          <p>
            25.M-S+左/右方向键：删除|插入列
          </p>
          <p>
            26.M-S+上/下方向键：删除|插入行
          </p>
          <p>
            27.C-c+-:添加水平分割线
          </p>
          <p>
            28.C-c+Ret:添加水平分割线并跳到下一行
          </p>
          <p>
            29.C-c+^:根据当前列排序，可以选择排序方式
          </p>
        </div>

      </div>

      <div id="outline-container-1-5" class="outline-3">
        <h3 id="sec-1-5"><span class="section-number-3">1.5</span> 列表</h3>
        <div class="outline-text-3" id="text-1-5">

          <p>Org能够识别有序列表、无序列表和描述列表。
          </p>
          <p>
            /*无序列表项以-、=+=、或者*开头。
          </p>
          <p>
            /*有序列表以1.或者1)开头。
          </p>
          <p>
            /*描述列表用::将项和描述分开。
          </p>
          <p>
            /*有序列表和无序列表都以缩进表示层级。只要对齐缩进，不管是换行还是分块都认为是处于当前列表项。
          </p>
          <p>
            同一列表中的项的第一行必须缩进相同程度。当下一行的缩进与列表项的开头的符号或者数字相同或者 更小时，这一项就结束了。当所有的项都关上时，或者后面有两个空行时，列表就结束了。
          </p>
          <p>
            快捷键：
          </p>
          <p>
            30.Tab:折叠列表项
          </p>
          <p>
            31.M-Ret:插入项
          </p>
          <p>
            32.M-s-上/下方向键:移动列表项
          </p>
          <p>
            33.M-左/右方向键：升降级列表项，不包括子项
          </p>
          <p>
            33.M-s-左/右方向键：升降级列表项，包括子项
          </p>
          <p>
            34.C-c+C-c:改变复选框状态
          </p>
          <p>
            35.C-c+-:更换列表标记(循环切换)
          </p>
        </div>
      </div>
    </div>
  </div>

  <div id="postamble">
    <p class="date">Date: 2016-07-22T19:59+0800</p>
    <p class="author">Author: ALIANG</p>
    <p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version
      24</p>
    <a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

  </div>
</body>

</html>